# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4,-2, 10, 2, 0,-9, 8, 10,-9, 0, -5, -5, 7]
# Диапазон: 5 15
# Вывод: [1, 9, 13, 14, 19]

list_of_numbers = [-5, 9, 0, 3, -1, -2, 1, 4,-2, 10, 2, 0,-9, 8, 10,-9, 0, -5, -5, 7]
min, max = input('Введите начало и конец диапазона: ').split()
indexes = []
for i in range(0, len(list_of_numbers)):
    if int(min) <= int(list_of_numbers[i]) <= int(max):
        indexes.append(i)
print(indexes)